MikroElektronika/core_packages/PIC/XC8/def/PIC16C782/mcu.h
// Register: REFCON
#define REFCON REFCON
extern volatile unsigned char           REFCON              __at(0x09B);
#ifndef _LIB_BUILD
asm("REFCON equ 09Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned VROE                   :1;
        unsigned VREN                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned VREFOE                 :1;
        unsigned VREFEN                 :1;
    };
} REFCONbits_t;
extern volatile REFCONbits_t REFCONbits __at(0x09B);
// bitfield macros
#define _REFCON_VROE_POSN                                   0x2
#define _REFCON_VROE_POSITION                               0x2
#define _REFCON_VROE_SIZE                                   0x1
#define _REFCON_VROE_LENGTH                                 0x1
#define _REFCON_VROE_MASK                                   0x4
#define _REFCON_VREN_POSN                                   0x3
#define _REFCON_VREN_POSITION                               0x3
#define _REFCON_VREN_SIZE                                   0x1
#define _REFCON_VREN_LENGTH                                 0x1
#define _REFCON_VREN_MASK                                   0x8
#define _REFCON_VREFOE_POSN                                 0x2
#define _REFCON_VREFOE_POSITION                             0x2
#define _REFCON_VREFOE_SIZE                                 0x1
#define _REFCON_VREFOE_LENGTH                               0x1
#define _REFCON_VREFOE_MASK                                 0x4
#define _REFCON_VREFEN_POSN                                 0x3
#define _REFCON_VREFEN_POSITION                             0x3
#define _REFCON_VREFEN_SIZE                                 0x1
#define _REFCON_VREFEN_LENGTH                               0x1
#define _REFCON_VREFEN_MASK                                 0x8

// Register: LVDCON
#define LVDCON LVDCON
extern volatile unsigned char           LVDCON              __at(0x09C);
#ifndef _LIB_BUILD
asm("LVDCON equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LV                     :4;
        unsigned LVDEN                  :1;
        unsigned BGST                   :1;
    };
    struct {
        unsigned LV0                    :1;
        unsigned LV1                    :1;
        unsigned LV2                    :1;
        unsigned LV3                    :1;
    };
} LVDCONbits_t;
extern volatile LVDCONbits_t LVDCONbits __at(0x09C);
// bitfield macros
#define _LVDCON_LV_POSN                                     0x0
#define _LVDCON_LV_POSITION                                 0x0
#define _LVDCON_LV_SIZE                                     0x4
#define _LVDCON_LV_LENGTH                                   0x4
#define _LVDCON_LV_MASK                                     0xF
#define _LVDCON_LVDEN_POSN                                  0x4
#define _LVDCON_LVDEN_POSITION                              0x4
#define _LVDCON_LVDEN_SIZE                                  0x1
#define _LVDCON_LVDEN_LENGTH                                0x1
#define _LVDCON_LVDEN_MASK                                  0x10
#define _LVDCON_BGST_POSN                                   0x5
#define _LVDCON_BGST_POSITION                               0x5
#define _LVDCON_BGST_SIZE                                   0x1
#define _LVDCON_BGST_LENGTH                                 0x1
#define _LVDCON_BGST_MASK                                   0x20
#define _LVDCON_LV0_POSN                                    0x0
#define _LVDCON_LV0_POSITION                                0x0
#define _LVDCON_LV0_SIZE                                    0x1
#define _LVDCON_LV0_LENGTH                                  0x1
#define _LVDCON_LV0_MASK                                    0x1
#define _LVDCON_LV1_POSN                                    0x1
#define _LVDCON_LV1_POSITION                                0x1
#define _LVDCON_LV1_SIZE                                    0x1
#define _LVDCON_LV1_LENGTH                                  0x1
#define _LVDCON_LV1_MASK                                    0x2
#define _LVDCON_LV2_POSN                                    0x2
#define _LVDCON_LV2_POSITION                                0x2
#define _LVDCON_LV2_SIZE                                    0x1
#define _LVDCON_LV2_LENGTH                                  0x1
#define _LVDCON_LV2_MASK                                    0x4
#define _LVDCON_LV3_POSN                                    0x3
#define _LVDCON_LV3_POSITION                                0x3
#define _LVDCON_LV3_SIZE                                    0x1
#define _LVDCON_LV3_LENGTH                                  0x1
#define _LVDCON_LV3_MASK                                    0x8

// Register: ANSEL
#define ANSEL ANSEL
extern volatile unsigned char           ANSEL               __at(0x09D);
#ifndef _LIB_BUILD
asm("ANSEL equ 09Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANS0                   :1;
        unsigned ANS1                   :1;
        unsigned ANS2                   :1;
        unsigned ANS3                   :1;
        unsigned ANS4                   :1;
        unsigned ANS5                   :1;
        unsigned ANS6                   :1;
        unsigned ANS7                   :1;
    };
} ANSELbits_t;
extern volatile ANSELbits_t ANSELbits __at(0x09D);
// bitfield macros
#define _ANSEL_ANS0_POSN                                    0x0
#define _ANSEL_ANS0_POSITION                                0x0
#define _ANSEL_ANS0_SIZE                                    0x1
#define _ANSEL_ANS0_LENGTH                                  0x1
#define _ANSEL_ANS0_MASK                                    0x1
#define _ANSEL_ANS1_POSN                                    0x1
#define _ANSEL_ANS1_POSITION                                0x1
#define _ANSEL_ANS1_SIZE                                    0x1
#define _ANSEL_ANS1_LENGTH                                  0x1
#define _ANSEL_ANS1_MASK                                    0x2
#define _ANSEL_ANS2_POSN                                    0x2
#define _ANSEL_ANS2_POSITION                                0x2
#define _ANSEL_ANS2_SIZE                                    0x1
#define _ANSEL_ANS2_LENGTH                                  0x1
#define _ANSEL_ANS2_MASK                                    0x4
#define _ANSEL_ANS3_POSN                                    0x3
#define _ANSEL_ANS3_POSITION                                0x3
#define _ANSEL_ANS3_SIZE                                    0x1
#define _ANSEL_ANS3_LENGTH                                  0x1
#define _ANSEL_ANS3_MASK                                    0x8
#define _ANSEL_ANS4_POSN                                    0x4
#define _ANSEL_ANS4_POSITION                                0x4
#define _ANSEL_ANS4_SIZE                                    0x1
#define _ANSEL_ANS4_LENGTH                                  0x1
#define _ANSEL_ANS4_MASK                                    0x10
#define _ANSEL_ANS5_POSN                                    0x5
#define _ANSEL_ANS5_POSITION                                0x5
#define _ANSEL_ANS5_SIZE                                    0x1
#define _ANSEL_ANS5_LENGTH                                  0x1
#define _ANSEL_ANS5_MASK                                    0x20
#define _ANSEL_ANS6_POSN                                    0x6
#define _ANSEL_ANS6_POSITION                                0x6
#define _ANSEL_ANS6_SIZE                                    0x1
#define _ANSEL_ANS6_LENGTH                                  0x1
#define _ANSEL_ANS6_MASK                                    0x40
#define _ANSEL_ANS7_POSN                                    0x7
#define _ANSEL_ANS7_POSITION                                0x7
#define _ANSEL_ANS7_SIZE                                    0x1
#define _ANSEL_ANS7_LENGTH                                  0x1
#define _ANSEL_ANS7_MASK                                    0x80

// Register: ADCON1
#define ADCON1 ADCON1
extern volatile unsigned char           ADCON1              __at(0x09F);
#ifndef _LIB_BUILD
asm("ADCON1 equ 09Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned VCFG                   :2;
    };
    struct {
        unsigned                        :4;
        unsigned VCFG0                  :1;
        unsigned VCFG1                  :1;
    };
} ADCON1bits_t;
