MikroElektronika/core_packages/PIC/XC8/def/PIC16C782/mcu.h
extern volatile ADCON1bits_t ADCON1bits __at(0x09F);
// bitfield macros
#define _ADCON1_VCFG_POSN                                   0x4
#define _ADCON1_VCFG_POSITION                               0x4
#define _ADCON1_VCFG_SIZE                                   0x2
#define _ADCON1_VCFG_LENGTH                                 0x2
#define _ADCON1_VCFG_MASK                                   0x30
#define _ADCON1_VCFG0_POSN                                  0x4
#define _ADCON1_VCFG0_POSITION                              0x4
#define _ADCON1_VCFG0_SIZE                                  0x1
#define _ADCON1_VCFG0_LENGTH                                0x1
#define _ADCON1_VCFG0_MASK                                  0x10
#define _ADCON1_VCFG1_POSN                                  0x5
#define _ADCON1_VCFG1_POSITION                              0x5
#define _ADCON1_VCFG1_SIZE                                  0x1
#define _ADCON1_VCFG1_LENGTH                                0x1
#define _ADCON1_VCFG1_MASK                                  0x20

// Register: PMDATL
#define PMDATL PMDATL
extern volatile unsigned char           PMDATL              __at(0x10C);
#ifndef _LIB_BUILD
asm("PMDATL equ 010Ch");
#endif

// Register: PMADRL
#define PMADRL PMADRL
extern volatile unsigned char           PMADRL              __at(0x10D);
#ifndef _LIB_BUILD
asm("PMADRL equ 010Dh");
#endif

// Register: PMDATH
#define PMDATH PMDATH
extern volatile unsigned char           PMDATH              __at(0x10E);
#ifndef _LIB_BUILD
asm("PMDATH equ 010Eh");
#endif

// Register: PMADRH
#define PMADRH PMADRH
extern volatile unsigned char           PMADRH              __at(0x10F);
#ifndef _LIB_BUILD
asm("PMADRH equ 010Fh");
#endif

// Register: CALCON
#define CALCON CALCON
extern volatile unsigned char           CALCON              __at(0x110);
#ifndef _LIB_BUILD
asm("CALCON equ 0110h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned CALREF                 :1;
        unsigned CALERR                 :1;
        unsigned CAL                    :1;
    };
} CALCONbits_t;
extern volatile CALCONbits_t CALCONbits __at(0x110);
// bitfield macros
#define _CALCON_CALREF_POSN                                 0x5
#define _CALCON_CALREF_POSITION                             0x5
#define _CALCON_CALREF_SIZE                                 0x1
#define _CALCON_CALREF_LENGTH                               0x1
#define _CALCON_CALREF_MASK                                 0x20
#define _CALCON_CALERR_POSN                                 0x6
#define _CALCON_CALERR_POSITION                             0x6
#define _CALCON_CALERR_SIZE                                 0x1
#define _CALCON_CALERR_LENGTH                               0x1
#define _CALCON_CALERR_MASK                                 0x40
#define _CALCON_CAL_POSN                                    0x7
#define _CALCON_CAL_POSITION                                0x7
#define _CALCON_CAL_SIZE                                    0x1
#define _CALCON_CAL_LENGTH                                  0x1
#define _CALCON_CAL_MASK                                    0x80

// Register: PSMCCON0
#define PSMCCON0 PSMCCON0
extern volatile unsigned char           PSMCCON0            __at(0x111);
#ifndef _LIB_BUILD
asm("PSMCCON0 equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :2;
        unsigned MAXDC                  :2;
        unsigned MINDC                  :2;
        unsigned SMCCL                  :2;
    };
    struct {
        unsigned DC0                    :1;
        unsigned DC1                    :1;
        unsigned MAXDC0                 :1;
        unsigned MAXDC1                 :1;
        unsigned MINDC0                 :1;
        unsigned MINDC1                 :1;
        unsigned SMCCL0                 :1;
        unsigned SMCCL1                 :1;
    };
} PSMCCON0bits_t;
extern volatile PSMCCON0bits_t PSMCCON0bits __at(0x111);
// bitfield macros
#define _PSMCCON0_DC_POSN                                   0x0
#define _PSMCCON0_DC_POSITION                               0x0
#define _PSMCCON0_DC_SIZE                                   0x2
#define _PSMCCON0_DC_LENGTH                                 0x2
#define _PSMCCON0_DC_MASK                                   0x3
#define _PSMCCON0_MAXDC_POSN                                0x2
#define _PSMCCON0_MAXDC_POSITION                            0x2
#define _PSMCCON0_MAXDC_SIZE                                0x2
#define _PSMCCON0_MAXDC_LENGTH                              0x2
#define _PSMCCON0_MAXDC_MASK                                0xC
#define _PSMCCON0_MINDC_POSN                                0x4
#define _PSMCCON0_MINDC_POSITION                            0x4
#define _PSMCCON0_MINDC_SIZE                                0x2
#define _PSMCCON0_MINDC_LENGTH                              0x2
#define _PSMCCON0_MINDC_MASK                                0x30
#define _PSMCCON0_SMCCL_POSN                                0x6
#define _PSMCCON0_SMCCL_POSITION                            0x6
#define _PSMCCON0_SMCCL_SIZE                                0x2
#define _PSMCCON0_SMCCL_LENGTH                              0x2
#define _PSMCCON0_SMCCL_MASK                                0xC0
#define _PSMCCON0_DC0_POSN                                  0x0
#define _PSMCCON0_DC0_POSITION                              0x0
#define _PSMCCON0_DC0_SIZE                                  0x1
#define _PSMCCON0_DC0_LENGTH                                0x1
#define _PSMCCON0_DC0_MASK                                  0x1
#define _PSMCCON0_DC1_POSN                                  0x1
#define _PSMCCON0_DC1_POSITION                              0x1
#define _PSMCCON0_DC1_SIZE                                  0x1
#define _PSMCCON0_DC1_LENGTH                                0x1
#define _PSMCCON0_DC1_MASK                                  0x2
#define _PSMCCON0_MAXDC0_POSN                               0x2
#define _PSMCCON0_MAXDC0_POSITION                           0x2
#define _PSMCCON0_MAXDC0_SIZE                               0x1
#define _PSMCCON0_MAXDC0_LENGTH                             0x1
#define _PSMCCON0_MAXDC0_MASK                               0x4
#define _PSMCCON0_MAXDC1_POSN                               0x3
#define _PSMCCON0_MAXDC1_POSITION                           0x3
#define _PSMCCON0_MAXDC1_SIZE                               0x1
#define _PSMCCON0_MAXDC1_LENGTH                             0x1
#define _PSMCCON0_MAXDC1_MASK                               0x8
#define _PSMCCON0_MINDC0_POSN                               0x4
#define _PSMCCON0_MINDC0_POSITION                           0x4
#define _PSMCCON0_MINDC0_SIZE                               0x1
#define _PSMCCON0_MINDC0_LENGTH                             0x1
#define _PSMCCON0_MINDC0_MASK                               0x10
#define _PSMCCON0_MINDC1_POSN                               0x5
#define _PSMCCON0_MINDC1_POSITION                           0x5
#define _PSMCCON0_MINDC1_SIZE                               0x1
#define _PSMCCON0_MINDC1_LENGTH                             0x1
#define _PSMCCON0_MINDC1_MASK                               0x20
#define _PSMCCON0_SMCCL0_POSN                               0x6
#define _PSMCCON0_SMCCL0_POSITION                           0x6
#define _PSMCCON0_SMCCL0_SIZE                               0x1
#define _PSMCCON0_SMCCL0_LENGTH                             0x1
#define _PSMCCON0_SMCCL0_MASK                               0x40
#define _PSMCCON0_SMCCL1_POSN                               0x7
#define _PSMCCON0_SMCCL1_POSITION                           0x7
#define _PSMCCON0_SMCCL1_SIZE                               0x1
#define _PSMCCON0_SMCCL1_LENGTH                             0x1
#define _PSMCCON0_SMCCL1_MASK                               0x80

