MikroElektronika/core_packages/PIC/XC8/def/PIC16C782/mcu.h
// Register: PSMCCON1
#define PSMCCON1 PSMCCON1
extern volatile unsigned char           PSMCCON1            __at(0x112);
#ifndef _LIB_BUILD
asm("PSMCCON1 equ 0112h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMCCS                  :1;
        unsigned PWM_nPSM               :1;
        unsigned SMCOM                  :1;
        unsigned SCEN                   :1;
        unsigned                        :1;
        unsigned S1BPOL                 :1;
        unsigned S1APOL                 :1;
        unsigned SMCON                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned PWM                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned PSM                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned nPSM                   :1;
    };
} PSMCCON1bits_t;
extern volatile PSMCCON1bits_t PSMCCON1bits __at(0x112);
// bitfield macros
#define _PSMCCON1_SMCCS_POSN                                0x0
#define _PSMCCON1_SMCCS_POSITION                            0x0
#define _PSMCCON1_SMCCS_SIZE                                0x1
#define _PSMCCON1_SMCCS_LENGTH                              0x1
#define _PSMCCON1_SMCCS_MASK                                0x1
#define _PSMCCON1_PWM_nPSM_POSN                             0x1
#define _PSMCCON1_PWM_nPSM_POSITION                         0x1
#define _PSMCCON1_PWM_nPSM_SIZE                             0x1
#define _PSMCCON1_PWM_nPSM_LENGTH                           0x1
#define _PSMCCON1_PWM_nPSM_MASK                             0x2
#define _PSMCCON1_SMCOM_POSN                                0x2
#define _PSMCCON1_SMCOM_POSITION                            0x2
#define _PSMCCON1_SMCOM_SIZE                                0x1
#define _PSMCCON1_SMCOM_LENGTH                              0x1
#define _PSMCCON1_SMCOM_MASK                                0x4
#define _PSMCCON1_SCEN_POSN                                 0x3
#define _PSMCCON1_SCEN_POSITION                             0x3
#define _PSMCCON1_SCEN_SIZE                                 0x1
#define _PSMCCON1_SCEN_LENGTH                               0x1
#define _PSMCCON1_SCEN_MASK                                 0x8
#define _PSMCCON1_S1BPOL_POSN                               0x5
#define _PSMCCON1_S1BPOL_POSITION                           0x5
#define _PSMCCON1_S1BPOL_SIZE                               0x1
#define _PSMCCON1_S1BPOL_LENGTH                             0x1
#define _PSMCCON1_S1BPOL_MASK                               0x20
#define _PSMCCON1_S1APOL_POSN                               0x6
#define _PSMCCON1_S1APOL_POSITION                           0x6
#define _PSMCCON1_S1APOL_SIZE                               0x1
#define _PSMCCON1_S1APOL_LENGTH                             0x1
#define _PSMCCON1_S1APOL_MASK                               0x40
#define _PSMCCON1_SMCON_POSN                                0x7
#define _PSMCCON1_SMCON_POSITION                            0x7
#define _PSMCCON1_SMCON_SIZE                                0x1
#define _PSMCCON1_SMCON_LENGTH                              0x1
#define _PSMCCON1_SMCON_MASK                                0x80
#define _PSMCCON1_PWM_POSN                                  0x1
#define _PSMCCON1_PWM_POSITION                              0x1
#define _PSMCCON1_PWM_SIZE                                  0x1
#define _PSMCCON1_PWM_LENGTH                                0x1
#define _PSMCCON1_PWM_MASK                                  0x2
#define _PSMCCON1_PSM_POSN                                  0x1
#define _PSMCCON1_PSM_POSITION                              0x1
#define _PSMCCON1_PSM_SIZE                                  0x1
#define _PSMCCON1_PSM_LENGTH                                0x1
#define _PSMCCON1_PSM_MASK                                  0x2
#define _PSMCCON1_nPSM_POSN                                 0x1
#define _PSMCCON1_nPSM_POSITION                             0x1
#define _PSMCCON1_nPSM_SIZE                                 0x1
#define _PSMCCON1_nPSM_LENGTH                               0x1
#define _PSMCCON1_nPSM_MASK                                 0x2

// Register: CM1CON0
#define CM1CON0 CM1CON0
extern volatile unsigned char           CM1CON0             __at(0x119);
#ifndef _LIB_BUILD
asm("CM1CON0 equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1CH                   :2;
        unsigned C1R                    :1;
        unsigned C1SP                   :1;
        unsigned C1POL                  :1;
        unsigned C1OE                   :1;
        unsigned C1OUT                  :1;
        unsigned C1ON                   :1;
    };
    struct {
        unsigned C1CH0                  :1;
        unsigned C1CH1                  :1;
    };
} CM1CON0bits_t;
extern volatile CM1CON0bits_t CM1CON0bits __at(0x119);
// bitfield macros
#define _CM1CON0_C1CH_POSN                                  0x0
#define _CM1CON0_C1CH_POSITION                              0x0
#define _CM1CON0_C1CH_SIZE                                  0x2
#define _CM1CON0_C1CH_LENGTH                                0x2
#define _CM1CON0_C1CH_MASK                                  0x3
#define _CM1CON0_C1R_POSN                                   0x2
#define _CM1CON0_C1R_POSITION                               0x2
#define _CM1CON0_C1R_SIZE                                   0x1
#define _CM1CON0_C1R_LENGTH                                 0x1
#define _CM1CON0_C1R_MASK                                   0x4
#define _CM1CON0_C1SP_POSN                                  0x3
#define _CM1CON0_C1SP_POSITION                              0x3
#define _CM1CON0_C1SP_SIZE                                  0x1
#define _CM1CON0_C1SP_LENGTH                                0x1
#define _CM1CON0_C1SP_MASK                                  0x8
#define _CM1CON0_C1POL_POSN                                 0x4
#define _CM1CON0_C1POL_POSITION                             0x4
#define _CM1CON0_C1POL_SIZE                                 0x1
#define _CM1CON0_C1POL_LENGTH                               0x1
#define _CM1CON0_C1POL_MASK                                 0x10
#define _CM1CON0_C1OE_POSN                                  0x5
#define _CM1CON0_C1OE_POSITION                              0x5
#define _CM1CON0_C1OE_SIZE                                  0x1
#define _CM1CON0_C1OE_LENGTH                                0x1
#define _CM1CON0_C1OE_MASK                                  0x20
#define _CM1CON0_C1OUT_POSN                                 0x6
#define _CM1CON0_C1OUT_POSITION                             0x6
#define _CM1CON0_C1OUT_SIZE                                 0x1
#define _CM1CON0_C1OUT_LENGTH                               0x1
#define _CM1CON0_C1OUT_MASK                                 0x40
#define _CM1CON0_C1ON_POSN                                  0x7
#define _CM1CON0_C1ON_POSITION                              0x7
#define _CM1CON0_C1ON_SIZE                                  0x1
#define _CM1CON0_C1ON_LENGTH                                0x1
#define _CM1CON0_C1ON_MASK                                  0x80
#define _CM1CON0_C1CH0_POSN                                 0x0
#define _CM1CON0_C1CH0_POSITION                             0x0
#define _CM1CON0_C1CH0_SIZE                                 0x1
#define _CM1CON0_C1CH0_LENGTH                               0x1
#define _CM1CON0_C1CH0_MASK                                 0x1
#define _CM1CON0_C1CH1_POSN                                 0x1
#define _CM1CON0_C1CH1_POSITION                             0x1
#define _CM1CON0_C1CH1_SIZE                                 0x1
#define _CM1CON0_C1CH1_LENGTH                               0x1
#define _CM1CON0_C1CH1_MASK                                 0x2

// Register: CM2CON0
#define CM2CON0 CM2CON0
extern volatile unsigned char           CM2CON0             __at(0x11A);
#ifndef _LIB_BUILD
asm("CM2CON0 equ 011Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C2CH                   :2;
        unsigned C2R                    :1;
        unsigned C2SP                   :1;
        unsigned C2POL                  :1;
        unsigned C2OE                   :1;
        unsigned C2OUT                  :1;
        unsigned C2ON                   :1;
    };
    struct {
        unsigned C2CH0                  :1;
        unsigned C2CH1                  :1;
    };
} CM2CON0bits_t;
extern volatile CM2CON0bits_t CM2CON0bits __at(0x11A);
// bitfield macros
#define _CM2CON0_C2CH_POSN                                  0x0
#define _CM2CON0_C2CH_POSITION                              0x0
#define _CM2CON0_C2CH_SIZE                                  0x2
#define _CM2CON0_C2CH_LENGTH                                0x2
#define _CM2CON0_C2CH_MASK                                  0x3
#define _CM2CON0_C2R_POSN                                   0x2
#define _CM2CON0_C2R_POSITION                               0x2
#define _CM2CON0_C2R_SIZE                                   0x1
#define _CM2CON0_C2R_LENGTH                                 0x1
#define _CM2CON0_C2R_MASK                                   0x4
#define _CM2CON0_C2SP_POSN                                  0x3
#define _CM2CON0_C2SP_POSITION                              0x3
#define _CM2CON0_C2SP_SIZE                                  0x1
#define _CM2CON0_C2SP_LENGTH                                0x1
#define _CM2CON0_C2SP_MASK                                  0x8
#define _CM2CON0_C2POL_POSN                                 0x4
#define _CM2CON0_C2POL_POSITION                             0x4
#define _CM2CON0_C2POL_SIZE                                 0x1
#define _CM2CON0_C2POL_LENGTH                               0x1
#define _CM2CON0_C2POL_MASK                                 0x10
#define _CM2CON0_C2OE_POSN                                  0x5
#define _CM2CON0_C2OE_POSITION                              0x5
#define _CM2CON0_C2OE_SIZE                                  0x1
#define _CM2CON0_C2OE_LENGTH                                0x1
#define _CM2CON0_C2OE_MASK                                  0x20
#define _CM2CON0_C2OUT_POSN                                 0x6
#define _CM2CON0_C2OUT_POSITION                             0x6
#define _CM2CON0_C2OUT_SIZE                                 0x1
#define _CM2CON0_C2OUT_LENGTH                               0x1
#define _CM2CON0_C2OUT_MASK                                 0x40
#define _CM2CON0_C2ON_POSN                                  0x7
#define _CM2CON0_C2ON_POSITION                              0x7
#define _CM2CON0_C2ON_SIZE                                  0x1
#define _CM2CON0_C2ON_LENGTH                                0x1
#define _CM2CON0_C2ON_MASK                                  0x80
#define _CM2CON0_C2CH0_POSN                                 0x0
#define _CM2CON0_C2CH0_POSITION                             0x0
#define _CM2CON0_C2CH0_SIZE                                 0x1
#define _CM2CON0_C2CH0_LENGTH                               0x1
#define _CM2CON0_C2CH0_MASK                                 0x1
#define _CM2CON0_C2CH1_POSN                                 0x1
#define _CM2CON0_C2CH1_POSITION                             0x1
#define _CM2CON0_C2CH1_SIZE                                 0x1
#define _CM2CON0_C2CH1_LENGTH                               0x1
#define _CM2CON0_C2CH1_MASK                                 0x2

// Register: CM2CON1
#define CM2CON1 CM2CON1
extern volatile unsigned char           CM2CON1             __at(0x11B);
#ifndef _LIB_BUILD
asm("CM2CON1 equ 011Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C2SYNC                 :1;
        unsigned                        :5;
        unsigned MC2OUT                 :1;
        unsigned MC1OUT                 :1;
    };
} CM2CON1bits_t;
extern volatile CM2CON1bits_t CM2CON1bits __at(0x11B);
// bitfield macros
#define _CM2CON1_C2SYNC_POSN                                0x0
#define _CM2CON1_C2SYNC_POSITION                            0x0
#define _CM2CON1_C2SYNC_SIZE                                0x1
#define _CM2CON1_C2SYNC_LENGTH                              0x1
#define _CM2CON1_C2SYNC_MASK                                0x1
#define _CM2CON1_MC2OUT_POSN                                0x6
#define _CM2CON1_MC2OUT_POSITION                            0x6
#define _CM2CON1_MC2OUT_SIZE                                0x1
#define _CM2CON1_MC2OUT_LENGTH                              0x1
#define _CM2CON1_MC2OUT_MASK                                0x40
#define _CM2CON1_MC1OUT_POSN                                0x7
#define _CM2CON1_MC1OUT_POSITION                            0x7
#define _CM2CON1_MC1OUT_SIZE                                0x1
#define _CM2CON1_MC1OUT_LENGTH                              0x1
#define _CM2CON1_MC1OUT_MASK                                0x80

// Register: OPACON
#define OPACON OPACON
extern volatile unsigned char           OPACON              __at(0x11C);
#ifndef _LIB_BUILD
asm("OPACON equ 011Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GBWP                   :1;
        unsigned                        :5;
        unsigned CMPEN                  :1;
        unsigned OPAON                  :1;
    };
} OPACONbits_t;
extern volatile OPACONbits_t OPACONbits __at(0x11C);
// bitfield macros
#define _OPACON_GBWP_POSN                                   0x0
#define _OPACON_GBWP_POSITION                               0x0
#define _OPACON_GBWP_SIZE                                   0x1
#define _OPACON_GBWP_LENGTH                                 0x1
#define _OPACON_GBWP_MASK                                   0x1
#define _OPACON_CMPEN_POSN                                  0x6
#define _OPACON_CMPEN_POSITION                              0x6
#define _OPACON_CMPEN_SIZE                                  0x1
#define _OPACON_CMPEN_LENGTH                                0x1
#define _OPACON_CMPEN_MASK                                  0x40
#define _OPACON_OPAON_POSN                                  0x7
#define _OPACON_OPAON_POSITION                              0x7
#define _OPACON_OPAON_SIZE                                  0x1
#define _OPACON_OPAON_LENGTH                                0x1
#define _OPACON_OPAON_MASK                                  0x80

// Register: DAC
#define DAC DAC
extern volatile unsigned char           DAC                 __at(0x11E);
#ifndef _LIB_BUILD
asm("DAC equ 011Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DA0                    :1;
        unsigned DA1                    :1;
        unsigned DA2                    :1;
        unsigned DA3                    :1;
        unsigned DA4                    :1;
        unsigned DA5                    :1;
        unsigned DA6                    :1;
        unsigned DA7                    :1;
    };
} DACbits_t;
extern volatile DACbits_t DACbits __at(0x11E);
// bitfield macros
#define _DAC_DA0_POSN                                       0x0
#define _DAC_DA0_POSITION                                   0x0
#define _DAC_DA0_SIZE                                       0x1
#define _DAC_DA0_LENGTH                                     0x1
#define _DAC_DA0_MASK                                       0x1
#define _DAC_DA1_POSN                                       0x1
#define _DAC_DA1_POSITION                                   0x1
#define _DAC_DA1_SIZE                                       0x1
#define _DAC_DA1_LENGTH                                     0x1
#define _DAC_DA1_MASK                                       0x2
#define _DAC_DA2_POSN                                       0x2
#define _DAC_DA2_POSITION                                   0x2
#define _DAC_DA2_SIZE                                       0x1
#define _DAC_DA2_LENGTH                                     0x1
#define _DAC_DA2_MASK                                       0x4
#define _DAC_DA3_POSN                                       0x3
#define _DAC_DA3_POSITION                                   0x3
#define _DAC_DA3_SIZE                                       0x1
#define _DAC_DA3_LENGTH                                     0x1
#define _DAC_DA3_MASK                                       0x8
#define _DAC_DA4_POSN                                       0x4
#define _DAC_DA4_POSITION                                   0x4
#define _DAC_DA4_SIZE                                       0x1
#define _DAC_DA4_LENGTH                                     0x1
#define _DAC_DA4_MASK                                       0x10
#define _DAC_DA5_POSN                                       0x5
#define _DAC_DA5_POSITION                                   0x5
#define _DAC_DA5_SIZE                                       0x1
#define _DAC_DA5_LENGTH                                     0x1
#define _DAC_DA5_MASK                                       0x20
#define _DAC_DA6_POSN                                       0x6
#define _DAC_DA6_POSITION                                   0x6
#define _DAC_DA6_SIZE                                       0x1
#define _DAC_DA6_LENGTH                                     0x1
#define _DAC_DA6_MASK                                       0x40
#define _DAC_DA7_POSN                                       0x7
#define _DAC_DA7_POSITION                                   0x7
#define _DAC_DA7_SIZE                                       0x1
#define _DAC_DA7_LENGTH                                     0x1
#define _DAC_DA7_MASK                                       0x80

// Register: DACON0
#define DACON0 DACON0
extern volatile unsigned char           DACON0              __at(0x11F);
#ifndef _LIB_BUILD
asm("DACON0 equ 011Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DARS                   :2;
        unsigned                        :4;
        unsigned DAOE                   :1;
        unsigned DAON                   :1;
    };
    struct {
        unsigned DARS0                  :1;
        unsigned DARS1                  :1;
    };
} DACON0bits_t;
